src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Объект", Параметры.Объект, Истина);
		Если ТипЗнч(Параметры.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
			Элементы.Объект.Заголовок = "Номенклатура";
			Объект = Параметры.Объект; 
		КонецЕсли;
		Если ТипЗнч(Параметры.Объект) = Тип("СправочникСсылка.Номенклатура") и Параметры.Объект.ИспользоватьПартии Тогда
			Элементы.ПартииНоменклатуры.Видимость = Истина; 			
		Иначе
			Элементы.ПартииНоменклатуры.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			// Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные);
			
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// МеханизмВнешнегоОборудования
&НаКлиенте
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
			
	Если ДанныеШтрикодов.Количество() > 0 Тогда	
		Штрихкод = ДанныеШтрикодов[ДанныеШтрикодов.Количество() - 1].Штрихкод;
		КлючЗаписи = СоздатьКлючЗаписи(Штрихкод);
		Если  НЕ КлючЗаписи = Неопределено Тогда			
			Элементы.Список.ТекущаяСтрока = КлючЗаписи;
		Иначе
			ФормаЗаписи = ПолучитьФорму("РегистрСведений.Штрихкоды.ФормаЗаписи");
			ФормаЗаписи.Запись.Объект = Объект;
			ФормаЗаписи.Запись.ШтрихКод = Штрихкод;
			Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
				ФормаЗаписи.Элементы.Объект.Заголовок = "Номенклатура";
				ФормаЗаписи.Элементы.Объект.ВыбиратьТип = Ложь; 
			КонецЕсли;
			ФормаЗаписи.УстановитьВидимость();
			ФормаЗаписи.Модифицированность = Истина;
			ФормаЗаписи.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолученыШтрихкоды()

// Конец МеханизмВнешнегоОборудования

&НаСервере
// Процедура, выполняет создание ключа записи
//
Функция СоздатьКлючЗаписи(ШтрихКод)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Штрихкоды.Штрихкод,
	                      |	Штрихкоды.Объект,
	                      |	Штрихкоды.ПартииНоменклатуры,
	                      |	Штрихкоды.Упаковка
	                      |ИЗ
	                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
	                      |ГДЕ
	                      |	Штрихкоды.Штрихкод = &Штрихкод
	                      |	И Штрихкоды.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Штрихкод", ШтрихКод);  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Структура = Новый Структура("Штрихкод, Объект, ПартииНоменклатуры, Упаковка");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		
		КлючЗаписи = РегистрыСведений.Штрихкоды.СоздатьКлючЗаписи(Структура);
		Возврат КлючЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;  	
	 
КонецФункции

#КонецОбласти
